{"pages":[{"title":"","text":"Aaron Ryu Software Developer “Cool Heads, Warm Hearts” fbcndah@gmail.com | +82 10 5549 7201 Seoul, 05328, Republic of Korea v2019.02 Skills Kotlin 1.3, Java 8+ w/ Spring C# w/ ASP.NET React.js and Angular.js w/ Typescript Education &amp; Experience Coupang, Seoul - Software Developer 2017.08 ~ Current - 쿠팡 내 여행 관련 상품에 대한 유저 경험을 증진시키기 위한 Java, Spring 를 활용한 웹 및 API 서비스 개발 한국과학기술원 전산학부 - 석사 2015.08 ~ 2017.08 - HypergraphDB와 같은 그래프 데이터베이스 조사, 하이퍼그래프에 대한 질의 프로세싱 관련 연구 한국항공대학교 컴퓨터 및 정보 공학과 - 학사 2011.02 ~ 2015.02 - Hadoop 및 HDFS 을 활용한 영상처리 연구 및 개발 Papers &amp; Conferences Attended 대용량 하이퍼그래프에 대한 효율적인 탐색 기법과 분석에의 응용 2017.07 - 컴퓨팅의 실제 분야: 정보과학회 컴퓨팅의 실제 논문지(KIISE Transactions on Computing Practices, KTCP)&gt; 류충모, 서정혁, 김명호 동형 서브그래프 검사를 이용한 향상된 하이퍼그래프 쿼리 시스템 설계 2017.06 - 2017 한국컴퓨터종합학술대회 (KCC 2017)&gt; 류충모, 서정혁, 김명호 대용량 하이퍼그래프에 대한 효율적인 BFS, DFS 탐색 기법 2016.12 - 한국정보과학회 (제43회) 2016년 동계학술대회 논문집, 205-207 + 우수발표논문상 수상&gt; 류충모, 서정혁, 김명호 하둡 분산 시스템에서의 효율적인 데이터 분할 기법 2015.06 - 한국정보과학회 학술발표논문집 (한국컴퓨터종합학술대회 논문집) 제42권 1호 1668~1670&gt; 장민욱, 이대철, 정재헌, 류충모, 김철기 Extensible Video Processing Framework in Apache Hadoop 2013.12 - IEEE International Conference on Cloud Computing Technology and Science (CloudCom) + Demo session&gt; 류충모, 이대철, 장민욱, 김철기, 서의성 Hadoop 기반 클라우드 컴퓨팅을 이용한 영상 처리 프레임워크 구현 2013.11 - 제40회 한국정보처리학회 추계학술발표대회 논문집 제20권 2호 139~142&gt; 류충모, 이대철, 장민욱, 김철기 Projects 대형 바이오 네트워크 데이터 분석을 위한 도구와 하이퍼그래프 데이터베이스 시스템 개발 2016.06 ~ 2017.07 GRRC (Cloud Computing System for Next-generation Broadcast Media) 2012.07 ~ 2013.06 - 비디오 작업을 위한 Hadoop 기반 프레임워크 제작 Patents 동영상 파일을 하둡 분산 파일 시스템에 분산 저장하는 시스템, 동영상 맵리듀스 시스템 및 그 제공방법 2013 - 특허 제 10-1460062호- 출원번호: 2013-0071441 / 출원일: 2013년 06월 21일, 등록일: 2014년 11월 04일- 김철기, 장민욱, 이대철, 유충모 Extracurricular activities TEDxKAIST – 오거나이저 중 ‘스피커(연사자 모집)’ 팀 2016.11 ~ 2017.03 - 12th TEDxKAIST WITH 개최 동아시아 평화 인권 캠프 (서울대 팀) 2014.02 ~ 2015.06","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/02/09/hello-world/"},{"title":"프로페셔널한 메일 주소를 만드는 방법","text":"좋은 메일 주소메일은 내용 및 형식뿐만 아니라 주소에도 예절이 있습니다. 가끔 전화번호에도 외우기 쉬운 전화번호들이 있습니다. 어떤 일에 연락하기 적합한 사람을 찾을때 머릿속에서 가장 쉽고, 먼저 떠오른다면 업무에 있어서나 헤드헌터에 의해 회사와 연결될때 더 많은 성과를 가져갈 수 있겠죠. 우리의 이메일 주소는 대개 아이디에 그 뒤에 네이버나 다음같은 도메인이 붙습니다.문제는 우리가 매우 어린나이에 네이버주니어 같은 서비스를 이용하기 위해 해당 도메인에 가입을 했다는것입니다. 그러다보면 우스꽝스럽거나 어떤 캐릭터 이름 혹은 귀여운 아이디가 대다수입니다. 마치 과거 버디버디 아이디를 들췄을때 부끄러운 그것 말이죠. 부끄러운건 당사자 뿐만이 아닙니다. 그 아이디로 연락을 하는 상대분들은 어떨까요. 외국 대학, 기업뿐아니라 외국인과 같이 커뮤니케이션을 하고싶다면 위와 같은 과거의 주소는 지양하는것이 좋습니다. 계속 써왔던 메일이라 새 메일주소를 생성하는것이 불편하시다면 메일 포워딩을 사용하시길 권장합니다. 추천 이메일일반적으로 다음과 같은 규칙을 갖기를 추천합니다. 핵심은 기억하기 쉬운 이메일 입니다.각 규칙에 들어가는 단어들은 첫글자나 약어로 하셔도 좋습니다만 되도록이면 온전한 단어로 쓰시는것이 기억하기 좋습니다. First Name 이름 First Name 이름 + Last Name 성 Generic : 메일 수신 목적에 맞는 이름 예는 다음과 같습니다. aaron@domain.com aaronryu@domain.com contact@domain.com 만약 Gmail 을 사용하신다면 다음과 같은 좋은 기능^1을 제공해주니 활용하시는것이 좋습니다. . : 마음껏 점을 찍어서 가독성을 높힐 수 있습니다. 점을 찍지않은 본래의 메일로 자동 포워딩됩니다. aaron.ryu@domain.com + : 받을때 특정 필터를 적용한 채로 메일을 수신할 수 있습니다. 이 또한 본래의 메일로 자동 포워딩됩니다. 이력서에 명시한 메일은 aaron.ryu+recruit 이라면 recruit 필터 규칙에 걸러집니다. aaron.ryu+recruit@domain.com 중복 이메일개인적으로 지메일에서 메일을 생성하려하니 중복된 주소가 이미 생성되어있었습니다.그럴때에는 각 아이디나 메일 입력 폼에 숫자를 붙이거나 성과 이름의 방향을 바꿔 추천해줍니다만 사용하지 않는것이 좋습니다. 외국인들은 이름 내 순서를 이름 + 성 으로 사용하기때문에 그 규칙을 그대로 따르는것이 좋습니다. 그렇지 않다면 외국인이 “성” 으로 저를 부를지도 모릅니다.생년을 적는다면 특히 나이에 대해 동양만큼 민감하지 않은 외국인들에게 그 사람을 떠올렸을때 몇년에 태어났는지까지 기억해야하는 불필요한 정보를 제공하게 됩니다. 이럴땐 어떻게 하는것이 좋을까요.쉽게는 직무를 명시할 수 있겠고, 번거롭게는 하나의 도메인을 생성하는것도 좋습니다. aaron.ryu.dev@domain.com = aaronryudev@domain.com aaronryu@aaronryu.com 아이디뿐만 아니라 도메인에도 자신의 이름이 중복으로 들어가서 언프로페셔널하게 느껴질것이 걱정되신다면 걱정하지 않으셔도 될 것 같습니다. 오히려 자신만의 도메인이 있다는것과 메일 시 직접 그 사람과 이야기한다는 느낌을 줄 수 있을 것입니다.^2 1: http://consultantjournal.com/blog/professional-email-address-ideas-for-common-names2: https://yeonlab.com/check-your-email-address/3: https://workplace.stackexchange.com/questions/11731/what-should-a-professional-email-address-look-like","link":"/2019/02/17/how-do-i-make-email-address/"}],"tags":[],"categories":[{"name":"Design Pattern","slug":"Design-Pattern","link":"/categories/Design-Pattern/"},{"name":"Test","slug":"Test","link":"/categories/Test/"},{"name":"Workplace","slug":"Workplace","link":"/categories/Workplace/"},{"name":"Nested","slug":"Test/Nested","link":"/categories/Test/Nested/"},{"name":"haha","slug":"Test/Nested/haha","link":"/categories/Test/Nested/haha/"},{"name":"hehe","slug":"Test/Nested/haha/hehe","link":"/categories/Test/Nested/haha/hehe/"}]}